{
  "list": [
    {
      "no": 1,
      "title": "자신에 대해 자유롭게 표현해 주세요",
      "content": "저는 디자인을 했었으며 현재는 퍼블리싱 겸 프론드엔드를 맡고 있습니다. 제가 디자인을 알고, 마크업을 아는 만큼 디자인팀과 UI/UX 관련 커뮤니케이션이 쉽게 오갑니다. 디자이너들이 지금까지 개발을 몰라 답답했던 부분을 설명하며 이해하는 것을 돕고 그들이 원하는 만큼 아웃풋을 만들기 위해 노력합니다. 기능적으로 어려운 일이 생겨도 디자이너의 맘을 알기에 안된다는 말보다는 차선 안을 제시합니다. Front-end 개발자가 디자인 출신인 것은 장점이라 생각하지만, '웹 디자인 출신 개발자'라는 말보다는 '디자인을 이해하는 Front-End 개발자'가 되기 위해 학점은행제를 통한 컴퓨터공학 학사학위를 공부 중입니다. 또한, Front-End 개발자로서 전문성을 갖추기 위해 ReactJS 나 VueJS, AngularJS 같은 Front-End Framework 중 러닝 커브가 낮은 Vue.js를 공부하여 집닥 부분 시공 (https://part.zipdoc.co.kr/)에 적용해 개발하였습니다."
    },
    {
      "no": 2,
      "title": "디자인 전공에서 개발자로 전향된 사유가 어떻게 되나요?",
      "content": "디자인을 하면서 느낀 점은 주관적인 점이 크다였습니다. 대학교에서 마크업 관련 수업을 들었는데 액션이 이루어지고 페이지 이동이 되는 부분이 신기했습니다. 그 후 마크업과 jquery 학원을 다녀보니 생각보다 쉬웠습니다. 이 정도면 더 큰 물에서 놀아보자는 생각에 프론트엔드 개발자로 전향하고 새로운 것들을 찾고 배우고 고민하다 아웃풋을 만들었을 때 즐거움을 느꼈습니다."
    },
    {
      "no": 3,
      "title": "프로그래밍을 시작한 경위와 본격적으로 투신하고 생업으로 삼기로 결정한 이야기를 해주세요.",
      "content": "제가 개발자가 된 이유는 답이 있다였습니다. 저는 중학생 때부터 디자인을 배웠습니다. 디자인을 하면서 느낀 점은 주관적인 점이 크다였습니다. 대학에서 마크업 관련 수업을 들었는데 액션이 이루어지고 페이지 이동이 되는 부분이 신기했습니다. 그 후 마크업과 jquery 학원을 다녀보니 생각보다 쉬웠습니다. 이 정도면 더 큰 물에서 놀아보자는 생각에 프론트엔드 개발자로 취업을 했습니다. 개발자로 전향하고 새로운 것들을 찾고 배우고 고민하고 아웃풋을 만들었을 때 개발자를 생업으로 삼기로 결정하였습니다."
    },
    {
      "no": 4,
      "title": "기술 경향을 파악하고 업무 역량을 강화하기 위한 본인의 학습 방법을 구체적으로 설명해주세요.",
      "content": "저는 부족했던 기술로 토이 프로젝트 만드는 것이 좋습니다. jQeury만 사용하다가 오직 javascript로만 개발하는 습관을 만들어보라 했을 때는 사다리 타기 프로젝트를, vue에 대한 공부를 시작할 때는 가계부와 트렐로 어드민 프로젝트를 만들었습니다. 책을 읽고 예제를 따라 하지만 이해가 안 가는 것이 많습니다. 그래도 일단 따라가기는 하지만 재미가 없었습니다. 하지만, 응용하여 프로젝트를 만들었을 때는 파악하고 생각하고 고민하고 찾아보고를 반복합니다. 계속 노트에 해결 방법 여러 가지를 적고 실행해보고 반복합니다."
    },
    {
      "no": 5,
      "title": "지금까지의 업무 경험에서 어떤 경험이 가장 가치가 있는지 이야기해주세요.",
      "content": "새로운 걸 공부하고 그것을 상용에 오픈할 때마다 가치가 있다고 느낍니다. 최근에 vue랑 nuxt를 사용하여 서비스를 오픈하였습니다. 지금까지 해왔던 것 중 참여도가 가장 높은 프로젝트이자 vue를 처음 사용하는 것이었어서 최대한 깔끔하게 개발하고 싶은 욕심에 다른 개발자들과 상의도 많이 하였고 열심히 테스트를 했습니다. 새로운 구조와 해왔던 것과 다른 사용법에 어렵기도 하였지만 해왔던 프로젝트보다 규모가 컸음에도 불구하고 이슈가 적게 나왔습니다."
    },
    {
      "no": 6,
      "title": "본인이 성공적으로 수행한 프로젝트의 성공요인이 무엇인지, 어려움을 극복하기 위해 어떤 방법을 사용했는지 기술하시오.",
      "content": "최근에 집닥 부분 시공이라는 프로젝트를 하였습니다. 해당 프로젝트는 QA까지 포함된 2달 남짓의 기간 안으로 해야 했던 인테리어 중개 플랫폼입니다. Vue.js 만 사용해봤었기에 서버 사이드 렌더링에 대한 고민이 많았습니다. Vue.js(vue-cli)는 기본적으로 SPA(Single Page Application) 프로젝트로 만들어져 검색엔진 최적화에 불리합니다. 물론 Vue.js 안에서 해결할 수 있는 방법이 몇 가지 있었지만 Vue.js 공식 가이드에서 추천하기도 했고 프론트엔드 스터디 했었을 때 언급이 나왔던 Nuxt.js를 사용하여 개발하기로 했습니다. 생각보다 Vue.js와 개발하는 방식은 큰 차이가 있지 않았으며 오히려 개발에 집중할 수 있는 환경이었습니다. 그로 인하여 서버사이드 렌더링은 제대로 구현이 되었고 짧은 기한 안에 적은 이슈로 프로젝트를 완료할 수 있었습니다. 이 사례를 들었던 이유는 내가 알았던 것만을 고집하는 것이 아닌 더 나은 방식을 도전해 더 좋은 결과를 도출하였다는 것이였습니다."
    }
  ]
}
